[
    {
        "title": "Kindness starts with you",
        "description": "This was my group project during the storytelling module of HyperIsland Motion Creative program. We had to design a short animation around the theme of kindness. The challenge was to convey the message in 15 seconds. After thorough ideation, our group decided on the idea of spreading smile/happiness.\n We used a 3-act structure for story telling. This was my first project as a project manager and I greatly enjoyed working with immensely talented people in my group. We also made a conscious effort of utilizing the concept of diversity and inclusion in our work.",
        "role": "Project Manager, Animation, Storyboarding, Background Characters Design",
        "tools": "Frame-by-frame animation, Adobe Photoshop, Illustrator, After-effects",
        "credits": [
            {
                "name": "Eric Bengtsso",
                "role": "Boardmatics, Composition, Art"
            },
            {
                "name": "Pen Hsiang Feng",
                "role": "Animation Lead, Background Design"
            },
            {
                "name": "Rakim Lee",
                "role": "Art Lead, Sound Design, Main Character Design"
            },
            {
                "name": "Yi Shen",
                "role": "Colorscript, Style Frames"
            },
            {
                "name": "Kateryna Shepel",
                "role": "Ideation"
            }
        ],
        "video": "https://youtube.com/embed/CwYI5EE6c_Y?feature=share"
    },
    {
        "title": "Spotify Loop Animation",
        "description": "This was an individual project during the HyperIsland Motion Creative program. I had to create an abstract loop animation for spotify canvas.",
        "tools": "Frame-by-frame animation in Adobe Photoshop",
        "video": "https://youtube.com/embed/_J6M3VYZ7NY?feature=share"
    },
    {
        "title": "The Breezy Walk Cycle",
        "description": "This animation was made as an individual project during the HyperIsland Motion Creative program and work I am most proud of. It was my first-ever walk cycle that I have designed using frame-by-frame animation technique.",
        "tools": "Frame-by-frame animation in Adobe Photoshop",
        "video": "https://www.youtube.com/embed/vr4xTo8JVVI"
    },
    {
        "title": "Frog animation loop",
        "description": "This was my first task at HyperIsland and I had to create a loop animation of choice. I was looking for inspiration and came across a beautiful swimming animation created by Emanuele Colombo, a motion design based in Italy. I wanted to try something similar but by using frame-by-frame animation. I decided my main character to be a frog because I love them (who doesn't, they are so unique, slimey, green 🐸). So I drew a frog swimming in the pool having the best time of its life.",
        "tools": "Frame-by-frame animation in Adobe Photoshop, Illustrator, After-effects",
        "video": "https://www.youtube.com/embed/0vb8BacHmsc"
    },
    {
        "title": "Hair animation tutorial",
        "description": "As a part of a learning module during the HyperIsland Motion Creative program, I conducted a short 30-minute workshop online on Zoom, covering hair movement animation using frame-by-frame technique in Adobe Photoshop and its comparison with achieving the same using Adobe After-effects.",
        "tools": "Frame-by-frame animation in Adobe Photoshop, Illustrator, After-effects",
        "video": "https://www.youtube.com/embed/ncMCg8AkeCA"
    },
    {
        "title": "Dog jump animation",
        "description": "This was an individual project during the HyperIsland Motion Creative program. I had to create a dog skipping animation for an online kids' book.",
        "role": "Illustration, Animation",
        "tools": "Adobe Illustrator, After-effects",
        "video": "https://youtube.com/embed/ipbRCkctHsk?feature=share"
    }
]